Repository: AJaeger74/libgphoto2
Catalog: libgphoto2_port/po/*.po
Languages: ar

source: Generic Port
ar: منفذ عام

source: No error
ar: لا أخطاء

source: Unspecified error
ar: خطأ غير محدد

source: I/O problem
ar: مشكلة إدخال/إخراج

source: Bad parameters
ar: معاملات سيئة

source: Unsupported operation
ar: عملية غير متاحة

source: Fixed limit exceeded
ar: تجاوز الحد الثابت

source: Timeout reading from or writing to the port
ar: انتهت مهلة القراءة أو الكتابة من/إلى المنفذ

source: Serial port not supported
ar: المنفذ التسلسلي غير مدعوم

source: USB port not supported
ar: منفذ USB غير مدعوم

source: Unknown port
ar: منفذ غير معروف

source: Out of memory
ar: نفاد الذاكرة

source: Error loading a library
ar: خطأ في تحميل مكتبة

source: Error initializing the port
ar: خطأ في تهيئة المنفذ

source: Error reading from the port
ar: خطأ في القراءة من المنفذ

source: Error writing to the port
ar: خطأ في الكتابة إلى المنفذ

source: Error updating the port settings
ar: خطأ في تحديث إعدادات المنفذ

source: Error setting the serial port speed
ar: خطأ في ضبط سرعة المنفذ التسلسلي

source: Error clearing a halt condition on the USB port
ar: خطأ في مسح شرط التوقف على منفذ USB

source: Could not find the requested device on the USB port
ar: لا أستطيع إيجاد الجهاز المطلوب على منفذ USB

source: Could not claim the USB device
ar: لا أستطيع المطالبة بجهاز USB

source: Could not lock the device
ar: لا أستطيع قفل الجهاز

source: libhal error
ar: خطأ libhal

source: Unknown error
ar: خطأ غير معروف

source: The operation '%s' is not supported by this device
ar: العملية '%s' غير مدعومة من قبل هذا الجهاز

source: The port has not yet been initialized
ar: لم يُهيأ المنفذ بعد

source: low
ar: منخفض

source: high
ar: عالي

source: No error description available
ar: لا يوجد وصف للخطأ متاح

source: Media '%s'
ar: الوسائط '%s'

source: Could not open USB device (%s).
ar: لا أستطيع فتح جهاز USB (%s).

source: Camera is already in use.
ar: الكاميرا قيد الاستخدام بالفعل.

source: Could not detach kernel driver of camera device.
ar: لا أستطيع فصل برنامج تشغيل النواة لجهاز الكاميرا.

source: Could not query kernel driver of device.
ar: لا أستطيع الاستعلام عن برنامج تشغيل النواة للجهاز.

source: Could not claim interface %d (%s). Make sure no other program (%s) or kernel module (such as %s) is using the device and you have read/write access to the device.
ar: لا أستطيع المطالبة بالواجهة %d (%s). تأكد أن لا برنامج آخر (%s) أو وحدة نواة (مثل %s) يستخدم الجهاز وأن لديك صلاحيات القراءة/الكتابة إليه.

source: MacOS PTPCamera service
ar: خدمة PTPCamera لنظام ماك أو إس

source: unknown libgphoto2 using program
ar: برنامج غير معروف يستخدم libgphoto2

source: Could not release interface %d (%s).
ar: لا أستطيع تحرير الواجهة %d (%s).

source: Could not reset USB port (%s).
ar: لا أستطيع إعادة ضبط منفذ USB (%s).

source: Could not reattach kernel driver of camera device.
ar: لا أستطيع إعادة إرفاق برنامج تشغيل النواة لجهاز الكاميرا.

source: Could not set config %d/%d (%s)
ar: لا أستطيع ضبط تشكيلة %d/%d (%s)

source: Could not set altsetting from %d to %d (%s)
ar: لا أستطيع ضبط الإعداد البديل من %d إلى %d (%s)

source: Could not find USB device (vendor 0x%x, product 0x%x). Make sure this device is connected to the computer.
ar: لا أستطيع إيجاد جهاز USB (المورد 0x%x، المنتج 0x%x). تأكد أن هذا الجهاز موصول بـ **الحاسوب**.

source: The supplied vendor or product id (0x%x,0x%x) is not valid.
ar: معرّف المورد أو المنتج المزود (0x%x,0x%x) غير صالح.

source: Could not find USB device (class 0x%x, subclass 0x%x, protocol 0x%x). Make sure this device is connected to the computer.
ar: لا أستطيع إيجاد جهاز USB (الصنف 0x%x، الصنف الفرعي 0x%x، البروتوكول 0x%x). تأكد أن هذا الجهاز موصول بـ **الحاسوب**.

source: PTP/IP Connection
ar: اتصال PTP/IP

source: IP Connection
ar: اتصال IP

source: Could not lock device '%s'
ar: لا أستطيع قفل الجهاز '%s'

source: Device '%s' is locked by pid %d
ar: الجهاز '%s' مقفول بمعرّف العملية %d

source: Device '%s' could not be locked (dev_lock returned %d)
ar: لا أستطيع قفل الجهاز '%s' (أعاد dev_lock القيمة %d)

source: Device '%s' could not be unlocked.
ar: لا أستطيع فك قفل الجهاز '%s'.

source: Device '%s' could not be unlocked as it is locked by pid %d.
ar: لا أستطيع فك قفل الجهاز '%s' لأنه مقفول بمعرّف العملية %d.

source: Device '%s' could not be unlocked (dev_unlock returned %d)
ar: لا أستطيع فك قفل الجهاز '%s' (أعاد dev_unlock القيمة %d)

source: Serial Port %i
ar: منفذ تسلسلي %i

source: Serial Port Device
ar: جهاز منفذ تسلسلي

source: Failed to open '%s' (%s).
ar: فشل فتح '%s' (%s).

source: Could not close '%s' (%s).
ar: لا أستطيع إغلاق '%s' (%s).

source: Could not write to port (%s)
ar: لا أستطيع الكتابة إلى المنفذ (%s)

source: Parity error.
ar: خطأ في التكافؤ.

source: Unexpected parity response sequence 0xff 0x%02x.
ar: تسلسل استجابة التكافؤ غير متوقع 0xff 0x%02x.

source: Unknown pin %i.
ar: دبوس %i غير معروف.

source: Could not get level of pin %i (%s).
ar: لا أستطيع الحصول على مستوى الدبوس %i (%s).

source: Could not set level of pin %i to %i (%s).
ar: لا أستطيع ضبط مستوى الدبوس %i إلى %i (%s).

source: Could not flush '%s' (%s).
ar: لا أستطيع تفريغ '%s' (%s).

source: Could not set the baudrate to %d
ar: لا أستطيع ضبط معدل الباود إلى %d

source: Could not detach kernel driver '%s' of camera device.
ar: لا أستطيع فصل برنامج تشغيل النواة '%s' لجهاز الكاميرا.

source: Could not close USB port (%s).
ar: لا أستطيع إغلاق منفذ USB (%s).

source: USB Mass Storage direct IO
ar: تخزين USB كبير الإدخال/الإخراج المباشر

source: Failed to open '%s' (%m).
ar: فشل فتح '%s' (%m).

source: Could not close '%s' (%m).
ar: لا أستطيع إغلاق '%s' (%m).

source: Could not seek to offset: %x on '%s' (%m).
ar: لا أستطيع البحث عن الإزاحة: %x على '%s' (%m).

source: Could not write to '%s' (%m).
ar: لا أستطيع الكتابة إلى '%s' (%m).

source: Could not read from '%s' (%m).
ar: لا أستطيع القراءة من '%s' (%m).

source: Device '%s' is locked by another app.
ar: الجهاز '%s' مقفول من تطبيق آخر.

source: Failed to lock '%s' (%m).
ar: فشل قفل '%s' (%m).

source: Failed to unlock '%s' (%m).
ar: فشل فك قفل '%s' (%m).

source: USB Mass Storage raw SCSI
ar: تخزين USB كبير SCSI خام

source: Could not send scsi command to: '%s' (%m).
ar: لا أستطيع إرسال أمر scsi إلى: '%s' (%m).
